import React, { Component } from "react";

function PrivacyPolicy() {
  return (
    <div style={{width: "650px", marginLeft: "500px"}}>
      捐捐不息十分重視您的隱私及個人資料的安全性。這份隱私權保護政策將向您說明我們如何保護您的個人資料：<br />
      一、您可能會透過我們的物資認購管道向我們提供您的個人資料。在您提供這些個人資料之前，我們會告知您關於資料蒐集的相關資訊，並依據法律要求，且在取得您的同意後，才依據您的同意進行個資蒐集及後續的使用與保存。<br />
      二、為確保捐贈者個人資料、隱私及權益，於捐贈過程中將使用捐贈者個人資料，謹依「個人資料保護法」第一章第8條規定告知以下事項：<br />
      （一）、蒐集目的：在於有效進行認購者關係維護。<br />
      （二）、蒐集方式：由認購者提供個人資料。<br />
      （三）、個人資料類別：於平台蒐集個人資料包括<br />
      1、辨識個人者：如認購者姓名、地址、電話、電子郵件等資訊。<br />
      2、辨識財務者：如信用卡、轉帳帳戶等資訊。<br />
      3、政府資料辨識者：如身分證字號或護照號碼（外國人）等資訊。<br />
      4、個人描述：如性別、國籍、出生年月日等資訊。<br />
      （四）、個人資料利用期間、地區、對象及方式： 1、期間：本平台營運期間。<br />
      2、地區：臺灣地區。<br />
      3、利用對象及方式：用於認購紀錄管理之檢索查詢、eCRM分析等功能。<br />
      4、用於金融交易及授權：認購者所提供財務相關資訊，將於金融交易過程（如信用卡授權、轉帳）時提交給金融機構以完成金融交易。<br />
      三、您可以自由選擇是否提供個人資料給我們。請知悉當我們無法取得推展業務所必須的個資時，我們可能無法提供您完整的服務。<br />
      四、我們只有在合理需要的情況下才會保留您的個人資料。我們將採取適當的安全措施，確保我們可安全、準確保存您的個人資料。<br />
      五、本隱私權保護政策的目的是就我們對於個人資料的保護進行通泛性地說明。若您希望能進一步了解您的個人資料在本會的蒐集處理利用狀況，或是當您有下列需求時，歡迎您透過trickleofbenefaction@gmail.com與我們聯繫：<br />
      1. 查詢或請求閱覽 2. 請求製作複本 3. 請求補充或更正 4.<br />
      請求停止蒐集、處理或利用 5. 請求刪除<br />
      六、捐捐不息保留調整本隱私權保護政策的權利。您可查閱本隱私權保護政策頁面最下方以確認本隱私權保護政策最後更新時間。若您有任何關於個資保護的疑問，歡迎您透過trickleofbenefaction@gmail.com與我們聯繫。<br />
    </div>
  );
}

export default PrivacyPolicy;
